// Подключение js
// for(let i = 0; i < 5; i++){
//   alert(`${i} i love JavaScript`)
// }

// -----------------------------------

// Работа с переменными

// let name = "Bahtiyar"
// let admin = name
// alert(admin)

// -----------------------------------

// Шаблонные строки

// let name = "Ilya";

// alert( `hello ${1}` ); // ? hello l

// alert( `hello ${"name"}` ); // ? hello name

// alert( `hello ${name}` ); // ? hello Ilya

// -----------------------------------

// Создайте страницу, которая спрашивает имя у пользователя и выводит его.

// let yourName = prompt()
// alert(yourName)

// -----------------------------------

//Чему будут равны переменные a, b, c и d в примере ниже?
// let a = 1, b = 1;

// let c = ++a; // ? 2
// let d = b++; // ? 1

// Чему будут равны переменные a и x после исполнения кода в примере ниже?

// let a = 2;

// let x = 1 + (a *= 2);
// a = 4, x = 5

// Какой результат будет у выражений ниже?
// "" + 1 + 0   // 10
// "" - 1 + 0   // -1
// true + false // 1
// 6 / "3"      // 2
// "2" * "3"    // 6
// 4 + 5 + "px" // 9px
// "$" + 4 + 5  // $45
// "4" - 2      // 2
// "4px" - 2    // error
// "  -9  " + 5 // -9 5
// "  -9  " - 5 // 14
// null + 1     // 1
// undefined + 1 // NaN
// " \t \n" - 2 // - 2
// Исправьте сложение
// let a = prompt("Первое число?", 1);
// let b = prompt("Второе число?", 2);

// alert(+a + +b);

// -----------------------------------

// Операторы сравнения
// Каким будет результат этих выражений?
// 5 > 4 // true
// "ананас" > "яблоко" //false
// "2" > "12" // true
// undefined == null // true
// undefined === null // false
// null == "\n0\n"  // false
// null === +"\n0\n" // false

// -----------------------------------
// Название JavaScript
// let answer = prompt("Какое «официальное» название JavaScript?")
// if(answer === "ECMAScript"){
//   alert ("Верно!")
// } else {
//   alert('Не знаете? ECMAScript!')
// }

// Покажите знак числа
// let answer = prompt()
// if(+answer > 0) {
//    alert(1)
//   }
// if(+answer === 0) {
//   alert(0)
// }
// if(+answer < 0) {
//   alert(-1)
// }

// Перепишите конструкцию if с использованием условного оператора '?':

// let result;
// if (a + b < 4) {
//   result = 'Мало';
// } else {
//   result = 'Много';
// }
// result = a + b < 4 ? 'Мало' : 'Много'

// let message;
// // if (login == 'Сотрудник') {
// //   message = 'Привет';
// // } else if (login == 'Директор') {
// //   message = 'Здравствуйте';
// // } else if (login == '') {
// //   message = 'Нет логина';
// // } else {
// //   message = '';
// // }
// message =
//   login == "Сотрудник"
//     ? Привет
//     : login == "Директор"
//     ? "Здравствуйте"
//     : login == ""
//     ? "Нет логина"
//     : "";

// -----------------------------------

// Что выведет alert (ИЛИ)?
// alert( null || 2 || undefined ); // 2
// alert( alert(1) || 2 || alert(3) ); // 1 2
// alert( 1 && null && 2 );  // null
// alert( alert(1) && alert(2) ) // 1 undefined
// alert( null || 2 && 3 || 4 ); // 3

// let value = NaN;

// value &&= 10;
// value ||= 20;
// value &&= 30;
// value ||= 40;
// alert(value); // 30

// Проверка значения из диапазона
// let age = 91
// if (age >= 14 && age <= 90){
//   alert ("yes")
// }

// Напишите условие if для проверки, что значение переменной age НЕ находится в диапазоне 14 и 90 включительно.
// if (!(age >= 14 && age <= 90)) {
//   alert('done')
// }
// if (!(age >= 14 && age <= 90)) {
//   alert('done')
// }
// if (age < 14 || age > 90) {
//   alert('done')
// }

// if (-1 || 0) alert( 'first' );
// if (-1 && 0) alert( 'second' );
// if (null || -1 && 1) alert( 'third' );
// // 'first' 'third'


// Проверка логина
// Напишите код, который будет спрашивать логин с помощью prompt.
// Если посетитель вводит «Админ», то prompt запрашивает пароль, если ничего не введено или нажата клавиша Esc – показать «Отменено», в противном случае отобразить «Я вас не знаю».
// Пароль проверять так:
// Если введён пароль «Я главный», то выводить «Здравствуйте!»,
// Иначе – «Неверный пароль»,
// При отмене или в случае если ничего не введено – «Отменено».

// const checkLogin = () => {
//   let login = prompt("логин");
//   if (login === "Админ") {
//     let password = prompt("пароль");
//     if (password === "Я главный") {
//       alert("«Здравствуйте");
//     } else {
//       alert("Неверный пароль");
//     }
//   } else if (login === "" || login === null) {
//     alert("Отменено");
//   } else {
//     alert("Я вас не знаю");
//   }
// };
// checkLogin();
